dpws/src/test/resources/org/somda/sdc/dpws/wsdl/WsdlRetrieverTest/MetadataWsdlEmbedded.xml

<s12:Envelope
        xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa10='http://www.w3.org/2005/08/addressing'
        xmlns:mex='http://schemas.xmlsoap.org/ws/2004/09/mex'
        xmlns:wsp='http://schemas.xmlsoap.org/ws/2004/09/policy'
        xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/'>
    <s12:Header>
        <wsa10:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa10:Action>
        <wsa10:To>http://client.example.org</wsa10:To>
        <wsa10:RelatesTo>urn:uuid:1cec121a-82fe-41da-87e1-3b23f254f128</wsa10:RelatesTo>
    </s12:Header>
    <s12:Body>
        <mex:Metadata>
            <mex:MetadataSection Dialect='http://schemas.xmlsoap.org/wsdl/'>
                <wsdl:definitions
                        name='StockQuote'
                        targetNamespace='http://services.example.org/stockquote'
                        xmlns:tns='http://services.example.org/stockquote'
                        xmlns:msgs='http://services.example.org/stockquote/schemas'
                        xmlns:wsoap='http://schemas.xmlsoap.org/wsdl/soap/'>
                    <wsdl:import namespace='http://services.example.org/stockquote'
                                 location='http://services.example.org/stockquote/schemas'/>
                    <wsdl:portType name='StockQuotePortType'>
                        <wsdl:operation name='GetLastTradePrice'>
                            <wsdl:input message='msgs:GetLastTradePriceInput' name='GetLastTradePriceInput'/>
                            <wsdl:output message='msgs:GetLastTradePriceOutput' name='GetLastTradePriceOutput'/>
                        </wsdl:operation>
                    </wsdl:portType>
                    <wsdl:binding name='StockQuoteBinding' type='tns:StockQuotePortType'>
                        <wsp:PolicyReference URI='http://services.example.org/stockquote/policy'/>
                        <wsoap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http'/>
                        <wsdl:operation name='GetLastTradePrice'>
                            <wsoap:operation soapAction='http://services.example.org/stockquote/GetLastTradePrice'/>
                            <wsdl:input name='GetLastTradePriceInput'>
                                <wsoap:body use='literal'/>
                            </wsdl:input>
                            <wsdl:output name='GetLastTradePriceOutput'>
                                <wsoap:body use='literal'/>
                            </wsdl:output>
                        </wsdl:operation>
                    </wsdl:binding>
                    <wsdl:service name='StockQuoteService'>
                        <wsdl:port name='StockQuotePort' binding='tns:StockQuoteBinding'>
                            <wsoap:address location='http://services.example.org/stockquote'/>
                        </wsdl:port>
                    </wsdl:service>
                </wsdl:definitions>
            </mex:MetadataSection>
        </mex:Metadata>
    </s12:Body>
</s12:Envelope>